//000000ER JOB 0-000-0-000,'E R E P             ',
//             CLASS=D,
//             NOTIFY=&SYSUID
//*
//STEP01 EXEC PGM=IFCEREP1,PARM='EVENT=Y,ACC=N'
//SERLOG  DD DSN=SYS1.LOGREC,DISP=SHR
//TOURIST DD SYSOUT=*
//EREPPT  DD SYSOUT=*,DCB=BLKSIZE=133
//SYSIN   DD DUMMY
//*
//STEP02 EXEC PGM=IFCEREP1,PARM='TYPE=SIE,PRINT=PS,ACC=N'
//SERLOG  DD DSN=SYS1.LOGREC,DISP=SHR
//TOURIST DD SYSOUT=*
//EREPPT  DD SYSOUT=*,DCB=BLKSIZE=133
//SYSIN   DD DUMMY
/*
