//00000000 JOB 0-000-0-000,'Hometest ',
//             CLASS=D,REGION=0M,MSGCLASS=X,TIME=NOLIMIT,
//             NOTIFY=&SYSUID
//*
//STEP01   EXEC PGM=IKJEFT1A
//SYSEXEC  DD   DUMMY
//SYSTSPRT DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//SYSTCPT  DD   SYSOUT=*
//SYSTSIN  DD   *
hometest
/*
//
