//00000000 JOB 0-000-0-000,'No Duplicates    ',
//             CLASS=D,REGION=0M,MSGCLASS=X,TIME=NOLIMIT,
//             NOTIFY=&SYSUID
//*
//STEP01   EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SORTIN   DD DISP=SHR,DSN=INPUT.DS
//SORTOUT  DD DISP=(,CATLG),DSN=OUTPUT.DS,
//            UNIT=3390,
//            SPACE=(CYL,(50,50),RLSE),
//            DCB=INPUT.DS
//SYSIN    DD *
 SORT FIELDS=(24,10,CH,A)
 SUM FIELDS=NONE
/*
