//00000000 JOB 0-000-0-000,'Test a Day       ',
//             CLASS=D,REGION=0M,MSGCLASS=X,TIME=NOLIMIT,
//             NOTIFY=&SYSUID
//*
//STEP01   EXEC PGM=IKJEFT1A,PARM='ISDAY SUNDAY'
//SYSEXEC  DD   DISP=SHR,DSN=REXX.LIBRARY
//SYSTSPRT DD   SYSOUT=*
//SYSTSIN  DD   DUMMY
